Revit 2027 API
InternalDefinitions Methods
The InternalDefinitions type exposes the following members.
Methods
Name | Description
Contains | Tests for the existence of a definition within the set.
(Inherited from Definitions)
Create | Creates a new parameter definition using specified options.
(Inherited from Definitions)
Dispose
(Inherited from Definitions)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
(Inherited from Definitions)
GetEnumerator | Retrieves an enumerator to the collection.
(Inherited from Definitions)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
InternalDefinitions Class
Autodesk.Revit.DB Namespace